wiki/20170918-ping.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ping</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">ping</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbff824c">1. brief</a></li>
<li><a href="#org91fc8ca">2. Introduction</a>
<ul>
<li><a href="#org05fda51">2.1. ping主要有两方面的应用：</a></li>
</ul>
</li>
<li><a href="#org6820fe9">3. The theory of ping</a></li>
<li><a href="#org789ac4b">4. Applications of Ping</a>
<ul>
<li><a href="#orgaa36b00">4.1. ping of death</a></li>
<li><a href="#org04f23eb">4.2. ping flood</a></li>
</ul>
</li>
<li><a href="#org51b2f9f">5. The Command of Ping（Linux）</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">DATE</th>
<th scope="col" class="org-left">modification</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2017.09.12</td>
<td class="org-left">初稿</td>
</tr>

<tr>
<td class="org-right">2017.09.25</td>
<td class="org-left">增加ping of death &amp;&amp; ping flood</td>
</tr>
</tbody>
</table>


<div id="outline-container-orgbff824c" class="outline-2">
<h2 id="orgbff824c"><span class="section-number-2">1</span> brief</h2>
<div class="outline-text-2" id="text-1">
<p>
估计这是世界上最流程的网络应用程序了，无论windows、*nix都提供了这样的一个命令行工具。
无论一个人是否学过计算机，只要经历过正儿八经的大学教育的人一旦百度打开不开，十之八九先想到这个程序。
今天详细介绍一些ping的前世今生。
</p>
</div>
</div>

<div id="outline-container-org91fc8ca" class="outline-2">
<h2 id="org91fc8ca"><span class="section-number-2">2</span> Introduction<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-2">
<p>
ping最开始是在1983年Mike Muuss撰写，被用于IP Network诊断问题诊断的一款工具。他的这个想法来源于David Mills提出的\
一个想法:利用ICMP echo报文进行IP Network diagnosis and measurements. 而ping的命名也仿效声纳系统，类似于定位水中的某个目标。
</p>
</div>

<div id="outline-container-org05fda51" class="outline-3">
<h3 id="org05fda51"><span class="section-number-3">2.1</span> ping主要有两方面的应用：</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>一般情况下，我们认为只要某个Host可以ping通，则认为该Host是active状态或者我们个人电脑网络是正常的。</li>
<li>ping程序还记录了ICMP包的往返时间RTT（round-trip time ），用于衡量两个Host之间的网络距离。</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org6820fe9" class="outline-2">
<h2 id="org6820fe9"><span class="section-number-2">3</span> The theory of ping<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-3">
<p>
我们先明确client和server的定义：我们将运行ping程序的一端为client，而接收ping程序发出的icmp echo request报文的机器为server。接收echo报文的server往往是实现在当前的tcp/ip协议栈中，即运行于kernel space；这于我们经常看到的运行于userspace空间的http server有较大的差别。
</p>

<p>
ICMP echo报文如下所示。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">type(8bits)</td>
<td class="org-left">code(8bits)</td>
<td class="org-left">checksum(16bits)</td>
</tr>

<tr>
<td class="org-left">identifier(16bits)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sequence number(16bits)</td>
</tr>

<tr>
<td class="org-left">optional data</td>
</tr>
</tbody>
</table>
<p>
ICMP server接收到 icmp echo request报文后，需要回复icmp echo reply报文；这一来一回中就可以判断两个属性：远方Host是否ping通，远方Host的RTT是多少。
icmp sever必须回显identifier、sequnence  number和optional data。在Unix ping实现中，identifier用来存放进程的PID，这可以在多个ping程序运行于同一个client的情况下，不同的ping程序区分哪些echo reply是自身发出的。
sequece number默认是从0开始计数，以1为步进；这样当某个ping包丢失（或者echo request，或者echo reply）时，我们可以察觉到。毕竟IP Network是一个“尽力而为”的网络。
</p>

<p>
从上面我们看不出关于timestamp的字段呢，ping是如何实现RTT的计数呢？
答案在optinal字段，每一个发出去的icmp echo request报文中的optional字段含有发出时刻的timestamp。由于icmp server必须回显optonal data，当icmp echo reply回到client时，client利用当前时间减去reply报文中的timestamp，既获取RTT。
</p>

<p>
历史原因，ping程序默认每隔1s发出一个echo request报文（无论echo reply是否到达)。在低俗网络下，如果通过CTRL+C中止ping程序的话，可能发出去的echo request还没有来得及回包从而最后一个或多个reply报文丢失，从而产生丢包率。
</p>
</div>
</div>


<div id="outline-container-org789ac4b" class="outline-2">
<h2 id="org789ac4b"><span class="section-number-2">4</span> Applications of Ping</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgaa36b00" class="outline-3">
<h3 id="orgaa36b00"><span class="section-number-3">4.1</span> ping of death</h3>
<div class="outline-text-3" id="text-4-1">
<p>
本质上ping of death是一种操作系统攻击手段。在上个世纪网络协议栈还没有足够的优化和存在较多bug的情况下，这种攻击具有现实意义；但在几乎所有的操作系统都增加了patch进行了修复；当前几乎不在具备现实意义（除了依然运行上个世纪老的操作系统）。
其基本原理是：IPV4数据包长度最大为65535bytes，如果源端制造大于该64435bytes的报文，如果end system不能识别这类报文，导致本身系统buffer overflow，从而系统crash甚至允许恶意代码注入。
</p>
<ul class="org-ul">
<li><a href="https://web.archive.org/web/19981206105844/http://www.sophist.demon.co.uk/ping/">可被攻击的操作系统List</a></li>
</ul>
</div>
</div>
<div id="outline-container-org04f23eb" class="outline-3">
<h3 id="org04f23eb"><span class="section-number-3">4.2</span> ping flood</h3>
<div class="outline-text-3" id="text-4-2">
<p>
ping flood 是一种DOS（denial-of-service attack）攻击方式，其攻击原理是：客户端发送大量的echo request报文，导致end system远端带宽不足或者系统资源不足，导致无法处理正常请求。
这类攻击往往没有很好的防止方法，要不将所有的echo request包不在接收直接丢弃；要么只能使用更多的资源硬抗。
</p>
</div>
</div>
</div>

<div id="outline-container-org51b2f9f" class="outline-2">
<h2 id="org51b2f9f"><span class="section-number-2">5</span> The Command of Ping（Linux）</h2>
<div class="outline-text-2" id="text-5">
<p>
Linux ping有很有用的参数：
</p>
<ul class="org-ul">
<li>c ：指定发送多少次echo request 包</li>
<li>f : flood mode, 向目的地址发起ping flood</li>
<li>i : 默认情况，每隔1s发送一次echo request报文；这个参数可以修改间隔期。</li>
<li>W : 设置echo request 报文的等待reply的timeout。</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
The link is : <a href="https://en.wikipedia.org/wiki/Ping_(networking_utility)">https://en.wikipedia.org/wiki/Ping_(networking_utility)</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
tcp/ip illustrated: volume 1
</p></div></div>


</div>
</div></div>
</body>
</html>
